org-files/raspberry.org
:PROPERTIES:
:ID:       d3201961-966d-4371-ae48-5dbcab004573
:END:
#+title: Raspberry
#+STARTUP: overview

#+date: 2023-12-15

#+hugo_custom_front_matter: :thumbnail "images/raspberry.png"
#+setupfile: ./setup.conf
#+hugo_tags: raspberry
#+hugo_categories: sos
#+hugo_draft: false

Todo sobre Raspberry

#+BEGIN_export html
<!--more-->
#+END_export

*** [[id:c3097e7a-7070-4d4f-ab60-f5a44e180f9d][Proceso de instalación]]
*** Argon One Pi4 V2 (Caja Raspberry Pi)
**** Jumper pin settings
- Pin 1-2: Modo por defecto, hay que pulsar el botón "ON" para encender
- Pin 2-3: Modo siempre on, no hay que pulsar para encender
- Argon ONE Pi 4 script 'curl https://download.argon40.com/argon1.sh|bash'
- Configurar utilidad 'argonone-config'
- Desinstalar utilidad 'argonone-uninstall'
*** Raspberry Pi 3B+
**** Configurar usb como método de arranque
- Instalar raspbian desde una microsd
- Ejecutar los siguientes comandos
#+BEGIN_SRC 
sudo apt update && sudo apt upgrade && sudo reboot
echo program_usb_boot_mode=1 | sudo tee -a /boot/config.txt
sudo reboot
#+END_SRC

