public_html/raspberry.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Raspberry</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Raspberry</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdecaa97">1. Proceso de instalación</a></li>
<li><a href="#org2c1c780">2. Argon One Pi4 V2 (Caja Raspberry Pi)</a>
<ul>
<li><a href="#org4ccbf02">2.1. Jumper pin settings</a></li>
</ul>
</li>
<li><a href="#orgcc0061c">3. Raspberry Pi 3B+</a>
<ul>
<li><a href="#orgc3d7ba2">3.1. Configurar usb como método de arranque</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Todo sobre Raspberry
</p>



<div id="outline-container-orgdecaa97" class="outline-2">
<h2 id="orgdecaa97"><span class="section-number-2">1.</span> <a href="raspberry_instalacion.html#ID-c3097e7a-7070-4d4f-ab60-f5a44e180f9d">Proceso de instalación</a></h2>
</div>
<div id="outline-container-org2c1c780" class="outline-2">
<h2 id="org2c1c780"><span class="section-number-2">2.</span> Argon One Pi4 V2 (Caja Raspberry Pi)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4ccbf02" class="outline-3">
<h3 id="org4ccbf02"><span class="section-number-3">2.1.</span> Jumper pin settings</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Pin 1-2: Modo por defecto, hay que pulsar el botón "ON" para encender</li>
<li>Pin 2-3: Modo siempre on, no hay que pulsar para encender</li>
<li>Argon ONE Pi 4 script 'curl <a href="https://download.argon40.com/argon1.sh%7Cbash">https://download.argon40.com/argon1.sh%7Cbash</a>'</li>
<li>Configurar utilidad 'argonone-config'</li>
<li>Desinstalar utilidad 'argonone-uninstall'</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcc0061c" class="outline-2">
<h2 id="orgcc0061c"><span class="section-number-2">3.</span> Raspberry Pi 3B+</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc3d7ba2" class="outline-3">
<h3 id="orgc3d7ba2"><span class="section-number-3">3.1.</span> Configurar usb como método de arranque</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Instalar raspbian desde una microsd</li>
<li>Ejecutar los siguientes comandos</li>
</ul>
<pre class="example">
sudo apt update &amp;&amp; sudo apt upgrade &amp;&amp; sudo reboot
echo program_usb_boot_mode=1 | sudo tee -a /boot/config.txt
sudo reboot
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-15</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
